# ➗ Делимость и остаток от деления в циклах  
**Информатика, 7 класс**

## 🎯 Цель урока

Научиться:
- понимать запись `i % M == 0`,
- определять, какие числа делятся без остатка,
- считать, сколько раз выполняется увеличение счётчика,
- решать задачи вида «Что выведет программа?» точно в формате сайта.

---

## 🔍 1. Как выглядит такое задание

На сайте задача обычно имеет вид:

```python
s = 0
for i in range(N):
    if i % M == 0:
        s = s + 1
print(s)
```

Нужно определить, что выведет программа.

На самом деле программа считает:

**сколько чисел от `0` до `N-1` делятся на `M` без остатка.**

---

## 🔍 2. Что означает `%`

Запись:

`i % M`

означает **остаток от деления** числа `i` на `M`.

### Примеры

- `8 % 4 = 0`
- `9 % 4 = 1`
- `10 % 4 = 2`
- `11 % 4 = 3`

Если:

`i % M == 0`

то число `i` делится на `M` **нацело**.

---

## 🧮 3. Полный разбор задачи формата сайта

### Задача 1

Что выведет программа?

```python
s = 0
for i in range(10):
    if i % 4 == 0:
        s = s + 1
print(s)
```

---

### Разбор

Сначала выпишем значения `i`:

`0, 1, 2, 3, 4, 5, 6, 7, 8, 9`

Теперь найдём те, которые делятся на 4:

- `0` делится на 4
- `4` делится на 4
- `8` делится на 4

Подходят:

`0, 4, 8`

Таких чисел **3**.

Значит, команда

`s = s + 1`

выполнится 3 раза.

✅ **Ответ: 3**

---

## 🧮 4. Ещё один подробный разбор

### Задача 2

Что выведет программа?

```python
s = 0
for i in range(20):
    if i % 3 == 0:
        s = s + 1
print(s)
```

---

### Разбор

`range(20)` даёт числа от `0` до `19`.

Среди них на 3 делятся:

`0, 3, 6, 9, 12, 15, 18`

Их **7**.

Значит, программа выведет:

✅ **Ответ: 7**

---

## 🧮 5. Ещё один пример, похожий на задания сайта

### Задача 3

Что выведет программа?

```python
s = 0
for i in range(21):
    if i % 7 == 0:
        s = s + 1
print(s)
```

---

### Разбор

`range(21)` даёт:

`0, 1, 2, ..., 20`

На 7 делятся:

`0, 7, 14`

Число `21` не входит, потому что `range(21)` заканчивается на `20`.

Значит, подходящих чисел **3**.

✅ **Ответ: 3**

---

## ✍️ 6. Как решать такие задания

### Способ 1. Через выписывание чисел

1. Выпишите числа из `range(N)`.
2. Отметьте кратные `M`.
3. Посчитайте их количество.

Этот способ самый надёжный.

### Способ 2. Через перечисление кратных

Сразу выписывайте:

`0, M, 2M, 3M, ...`

пока числа меньше `N`.

Например, для `range(30)` и делителя `6`:

`0, 6, 12, 18, 24`

Число `30` уже не входит.

Значит, ответ: `5`.

---

## 📊 Типичные ошибки

| Ошибка | Как избежать |
|--------|--------------|
| Забывают число 0 | 0 делится на любое ненулевое число |
| Берут число `N`, хотя оно не входит в `range(N)` | Последнее число — `N-1` |
| Думают, что `%` — это деление | `%` даёт остаток, а не частное |
| Ищут сумму чисел, а не количество | `s = s + 1` считает именно число подходящих значений |

---

## 💡 Самая важная мысль

Если в программе есть:

```python
if i % M == 0:
    s = s + 1
```

то программа не делает ничего сложного.  
Она просто отвечает на вопрос:

**«Сколько чисел в `range(N)` делятся на `M`?»**

Как только ты научишься видеть это сразу, такие задания будут решаться очень быстро.
